___

<p style="text-align: center;"><img src="https://docs.google.com/uc?id=1lY0Uj5R04yMY3-ZppPWxqCr5pvBLYPnV" class="img-fluid" alt="Rossum"></p>


____

In [1]:
import pandas as pd

In [2]:
ecom = pd.read_csv('data.csv',encoding= 'unicode_escape')

**Check the head of the DataFrame.**

In [3]:
ecom.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,12/1/2010 8:26,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,12/1/2010 8:26,2.75,17850.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,12/1/2010 8:26,3.39,17850.0,United Kingdom

** How many rows and columns are there? **

In [4]:
print("Number of raws and columns(raws,columns):", ecom.shape)

Number of raws and columns(raws,columns): (541909, 8)

** Show the statistical measurements of ecom dataset **

In [5]:
ecom.describe()

            Quantity      UnitPrice     CustomerID
count  541909.000000  541909.000000  406829.000000
mean        9.552250       4.611114   15287.690570
std       218.081158      96.759853    1713.600303
min    -80995.000000  -11062.060000   12346.000000
25%         1.000000       1.250000   13953.000000
50%         3.000000       2.080000   15152.000000
75%        10.000000       4.130000   16791.000000
max     80995.000000   38970.000000   18287.000000

** What is the average Purchase Price? **

In [6]:
ecom[["UnitPrice"]].mean()

UnitPrice    4.611114
dtype: float64

** What were the highest and lowest purchase prices? **

In [7]:
ecom[["UnitPrice"]].agg([min, max])

     UnitPrice
min  -11062.06
max   38970.00

** List the country names and number of records belongs to each country **

In [8]:
Country_Records = ecom.groupby("Country").agg(lambda x: len(x))
Country_Records.sample(5)

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID
Country,,,,,,,
Lithuania,35,35,35,35,35,35,35
Austria,401,401,401,401,401,401,401
Norway,1086,1086,1086,1086,1086,1086,1086
Germany,9495,9495,9495,9495,9495,9495,9495
European Community,61,61,61,61,61,61,61

** How many records are as Country United Kingdom? **

In [9]:
Country_Records.loc[["United Kingdom"]]

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID
Country,,,,,,,
United Kingdom,495478,495478,495478,495478,495478,495478,495478

** Create a column named Total which shows the total amount of spend using UnitPrice and Quantity ? **

In [10]:
ecom["Total"] = ecom["Quantity"] * ecom["UnitPrice"]
ecom.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,Total
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,12/1/2010 8:26,2.55,17850.0,United Kingdom,15.30
1,536365,71053,WHITE METAL LANTERN,6,12/1/2010 8:26,3.39,17850.0,United Kingdom,20.34
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,12/1/2010 8:26,2.75,17850.0,United Kingdom,22.00
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,12/1/2010 8:26,3.39,17850.0,United Kingdom,20.34
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,12/1/2010 8:26,3.39,17850.0,United Kingdom,20.34

** Show total spending amount according to the Countries **

In [11]:
ecom.groupby("Country")[["Total"]].sum().sample(5)

              Total
Country
RSA         1002.31
Singapore   9120.39
Greece      4710.52
Lebanon     1693.88
Portugal   29367.02

** Which Country spend least? **

In [12]:
#Least = ecom.groupby("Country")[["Total"]].sum()
#Least.idxmin()
ecom.groupby("Country")[["Total"]].sum().idxmin()

Total    Saudi Arabia
dtype: object

** Calculate average of spending according to country with apply function? **

In [13]:
ecom.groupby("Country")[["Total"]].sum().mean()

Total    256519.682474
dtype: float64

** Calculate average,min,max of spending according to country with agg function? **

In [14]:
ecom.groupby("Country")[["Total"]].agg([min, max, "mean"]).sample(5)

                      Total
                        min      max        mean
Country
Netherlands         -266.40  4992.00  120.059696
Unspecified            0.19    69.36   10.649753
Japan              -1591.20  3794.40   98.716816
Lebanon               10.20   153.00   37.641778
European Community    -8.50    60.00   21.176230

** What is the max Total spending in whole dataset and show the records of that spending ?**

In [15]:
# ecom.groupby("Country")[["Total"]].agg([max]).max()
ecom.sort_values("Total",ascending=False).head(1)
#ecom.sort_values("Total",ascending=False).max()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,Total
540421,581483,23843,"PAPER CRAFT , LITTLE BIRDIE",80995,12/9/2011 9:15,2.08,16446.0,United Kingdom,168469.6

** How many people who live in Spain spend more than average Total ?**

In [16]:
a=ecom[ecom["Country"]=="Spain"].loc[ecom["Total"]>ecom["Total"].mean()].count().Total
print("Number of people who live in Spain spend more than average Total is :", {a})

Number of people who live in Spain spend more than average Total is : {728}

** Convert datatype of InvoiceDate to datetime and assign it to new column name InvoiceDate2**

In [17]:
ecom['InvoiceDate2']=pd.to_datetime(ecom.InvoiceDate)
ecom.sample()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,Total,InvoiceDate2
130376,547488,21977,PACK OF 60 PINK PAISLEY CAKE CASES,6,3/23/2011 11:30,0.55,13821.0,United Kingdom,3.3,2011-03-23 11:30:00

** Take only date values (year-month-day) from InvoiceDate2 and assign it to a new column named date **

In [18]:
ecom["Date"] = pd.to_datetime(ecom.InvoiceDate2.dt.date)
ecom.sample()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,Total,InvoiceDate2,Date
523844,580520,22956,36 FOIL HEART CAKE CASES,1,12/4/2011 14:55,0.79,13521.0,United Kingdom,0.79,2011-12-04 14:55:00,2011-12-04

** drop InvoiceDate2 and InvoiceDate columns permanently **

In [19]:
ecom.drop(["InvoiceDate","InvoiceDate2"], axis=1, inplace=True)
ecom.sample()

,InvoiceNo,StockCode,Description,Quantity,UnitPrice,CustomerID,Country,Total,Date
99295,544767,20712,JUMBO BAG WOODLAND ANIMALS,4,4.13,NaN,United Kingdom,16.52,2011-02-23

** Remove A, B, G and E from StockCode in first 5 rows of ecom dataframe with a string method **

In [20]:
ecom.StockCode.str.rstrip("ABGE").head()

0    85123
1    71053
2    84406
3    84029
4    84029
Name: StockCode, dtype: object

** take only Total and date columns with loc and craete a new df named ecom2 **

In [21]:
ecom2 = ecom.loc[:,["Total", "Date"]]
ecom2.sample()

        Total       Date
330107    8.5 2011-09-07

** take only InvoiceNo, CustomerID and Total columns with iloc and craete a new df named ecom3 **

In [32]:
ecom3 = ecom.iloc[:, [0,5, 7]]
ecom3.sample()

       InvoiceNo  CustomerID  Total
538273    581404     13680.0   12.5

** Combine ecom2 and ecom3 with concat **

In [33]:
pd.concat([ecom2, ecom3]).sample(5)

        Total       Date InvoiceNo  CustomerID
229078  30.00 2011-06-16       NaN         NaN
507204  17.50 2011-11-28       NaN         NaN
9117     2.95 2010-12-05       NaN         NaN
525491   0.85 2011-12-05       NaN         NaN
257742   1.17 2011-07-10       NaN         NaN

** Combine ecom2 and ecom3 with merge. If memory error occurs take only first 400 rows from both DFs.**

In [38]:
pd.merge(ecom2.iloc[:400,:],ecom3.iloc[:400,:]).head()

   Total       Date InvoiceNo  CustomerID
0   15.3 2010-12-01    536365     17850.0
1   15.3 2010-12-01    536373     17850.0
2   15.3 2010-12-01    536373     17850.0
3   15.3 2010-12-01    536375     17850.0
4   15.3 2010-12-01    536375     17850.0

** Combine ecom2 and ecom3 with join (inner)**

In [40]:
ecom2.join(ecom3, how="inner",lsuffix='_left',rsuffix='_right').head()

   Total_left       Date InvoiceNo  CustomerID  Total_right
0       15.30 2010-12-01    536365     17850.0        15.30
1       20.34 2010-12-01    536365     17850.0        20.34
2       22.00 2010-12-01    536365     17850.0        22.00
3       20.34 2010-12-01    536365     17850.0        20.34
4       20.34 2010-12-01    536365     17850.0        20.34

# Congrats!